In [1]:
#importing python library
import pandas as pd
import numpy as np

In [2]:
#DataFrme will have its index assigned automatically,
#the columns are placed in sorted order
data={'state':['Ohio','Ohio','Ohio','Neveda','Neveda','Neveda'],'year':[2000,2001,2002,2001,2002,2003],'pop':[1.5,1.7,3.6,2.4,2.9,3.2]}
frame=pd.DataFrame(data)
#using the Jupyter notebook,pandas DataFrame objects will be displayed as a more brower-friendly HTML table.
frame

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Neveda  2001  2.4
4  Neveda  2002  2.9
5  Neveda  2003  3.2

In [3]:
#head method selects only first five rows
frame.head()

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Neveda  2001  2.4
4  Neveda  2002  2.9

In [4]:
#specify a sequence od columns
pd.DataFrame(data,columns=['year','state','pop'])

   year   state  pop
0  2000    Ohio  1.5
1  2001    Ohio  1.7
2  2002    Ohio  3.6
3  2001  Neveda  2.4
4  2002  Neveda  2.9
5  2003  Neveda  3.2

In [5]:
#If you pass a column that isn't contained in the dict,it will appear with missing values in the result
frame2=pd.DataFrame(data,columns=['year','state','pop','debt'],index=['one','two','three','four','five','six'])
frame2

       year   state  pop debt
one    2000    Ohio  1.5  NaN
two    2001    Ohio  1.7  NaN
three  2002    Ohio  3.6  NaN
four   2001  Neveda  2.4  NaN
five   2002  Neveda  2.9  NaN
six    2003  Neveda  3.2  NaN

In [6]:
frame2.columns

Index(['year', 'state', 'pop', 'debt'], dtype='object')

In [7]:
#A column in a DataFrame can be retrieved as a Series either by dict-like notation or by attribute
frame2['state']

one        Ohio
two        Ohio
three      Ohio
four     Neveda
five     Neveda
six      Neveda
Name: state, dtype: object

In [8]:
frame2.year

one      2000
two      2001
three    2002
four     2001
five     2002
six      2003
Name: year, dtype: int64

In [9]:
#Rows can be retrieved by position or name with the special loc attribute
frame2.loc['three']

year     2002
state    Ohio
pop       3.6
debt      NaN
Name: three, dtype: object

In [10]:
#Columns can be modified by assignment
#'debt' column could be assigned a scalar value or an array of values
frame2['debt']=16.5
frame2

       year   state  pop  debt
one    2000    Ohio  1.5  16.5
two    2001    Ohio  1.7  16.5
three  2002    Ohio  3.6  16.5
four   2001  Neveda  2.4  16.5
five   2002  Neveda  2.9  16.5
six    2003  Neveda  3.2  16.5

In [11]:
frame2['debt']=np.arange(6.)
frame2

       year   state  pop  debt
one    2000    Ohio  1.5   0.0
two    2001    Ohio  1.7   1.0
three  2002    Ohio  3.6   2.0
four   2001  Neveda  2.4   3.0
five   2002  Neveda  2.9   4.0
six    2003  Neveda  3.2   5.0

In [12]:
#assign a Series,its labels will be realigned exactly to the DataFrame's index,inserting missing values in any holes
val=pd.Series([-1.2,-1.5,-1.7],index=['two','four','five'])
frame2['debt']=val
frame2

       year   state  pop  debt
one    2000    Ohio  1.5   NaN
two    2001    Ohio  1.7  -1.2
three  2002    Ohio  3.6   NaN
four   2001  Neveda  2.4  -1.5
five   2002  Neveda  2.9  -1.7
six    2003  Neveda  3.2   NaN

In [13]:
#add a new column of boolean values where the state column equals 'Ohio'
frame2['eastern']=frame2.state=='Ohio'
frame2

       year   state  pop  debt  eastern
one    2000    Ohio  1.5   NaN     True
two    2001    Ohio  1.7  -1.2     True
three  2002    Ohio  3.6   NaN     True
four   2001  Neveda  2.4  -1.5    False
five   2002  Neveda  2.9  -1.7    False
six    2003  Neveda  3.2   NaN    False

In [14]:
#The del method can then be used to remove this column
del frame2['eastern']
frame2.columns

Index(['year', 'state', 'pop', 'debt'], dtype='object')

In [15]:
#data is a nested dict of dicts
pop={'Neveda':{2001:2.4,2002:2.9},'Ohio':{2000:1.5,2001:1.7,2002:3.6}}
frame3=pd.DataFrame(pop)
frame3

      Neveda  Ohio
2001     2.4   1.7
2002     2.9   3.6
2000     NaN   1.5

In [16]:
frame3.T

        2001  2002  2000
Neveda   2.4   2.9   NaN
Ohio     1.7   3.6   1.5

In [17]:
#sorted to form the index in the result
pd.DataFrame(pop,index=[2001,2002,2003])

      Neveda  Ohio
2001     2.4   1.7
2002     2.9   3.6
2003     NaN   NaN

In [18]:
#DataFrame's index and columns have their name attributes set
frame3.index.name='year';frame3.columns.name='state'
frame3

state  Neveda  Ohio
year
2001      2.4   1.7
2002      2.9   3.6
2000      NaN   1.5

In [19]:
#values attributes returns the data contained in the DataFrame as a two-dimensional ndarray
frame3.values

array([[2.4, 1.7],
       [2.9, 3.6],
       [nan, 1.5]])

In [20]:
frame2.values

array([[2000, 'Ohio', 1.5, nan],
       [2001, 'Ohio', 1.7, -1.2],
       [2002, 'Ohio', 3.6, nan],
       [2001, 'Neveda', 2.4, -1.5],
       [2002, 'Neveda', 2.9, -1.7],
       [2003, 'Neveda', 3.2, nan]], dtype=object)